<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates .bes file for Kaltura Capture installer and uploads it to BigFix</string>
    <key>Identifier</key>
    <string>edu.psu.bigfix.KalturaCapture</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Kaltura Capture</string>
        <key>SHORTNAME</key>
        <string>Kaltura-Capture</string>
        <key>ARCHITECTURE</key>
        <string>x86_x64</string>
        <key>PLATFORM</key>
        <string>Windows</string>
        <key>bes_icon</key>
        <string>http://bes.win.psu.edu:52311/ManualUploads/PSU/Icons/Kaltura-Capture.png</string>
        <key>OfferCategory</key>
        <string>Media</string>
        <key>bes_ssa</key>
        <string>True</string>
        <key>bes_ssaaction</key>
        <string>DefaultAction</string>
        <key>LICENSE</key>
        <string>%NAME% is freeware.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>edu.psu.download.KalturaCapture</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>/Volumes/ManualUploads$/PSU-Windows/Kaltura/</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>OfferDescriptionHTML</key>
                <string><![CDATA[<STRONG><FONT size=3>About Kaltura Capture</FONT></STRONG>
<BLOCKQUOTE>Make it easy to create videos and other rich media, without specialized equipment.</BLOCKQUOTE>
<P><FONT color=#0080ff size=3><STRONG>Licensing</STRONG></FONT></P>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P>Kaltura Capture is licensed for Penn State systems.</P></BLOCKQUOTE><STRONG>
<P><FONT size=3>About This Task</FONT></P></STRONG>
<BLOCKQUOTE>This task will install/upgrade: %NAME% %version% .<BR><BR>This task is applicable on: Windows systems</BLOCKQUOTE>
]]></string>
                <key>bes_overrideurl</key>
                <string>http://bes.win.psu.edu:52311/ManualUploads/PSU-Windows/Microsoft/Edge/%filename%</string>
                <key>bes_filename</key>
                <string>%filename%</string>
                <!-- Enable to get prefetch from different file
                <key>bes_softwareinstaller</key>
                <string>%SHORTNAME%.exe</string>-->
                <key>bes_version</key>
                <string>%version%</string>
                <key>bes_title</key>
                <string>Install/Upgrade: %NAME% %version% - %PLATFORM%</string>
                <key>bes_description</key>
                <string><![CDATA[<STRONG><FONT size=3>About Kaltura Capture</FONT></STRONG>
<BLOCKQUOTE>Make it easy to create videos and other rich media, without specialized equipment.</BLOCKQUOTE>
<P><FONT color=#0080ff size=3><STRONG>Licensing</STRONG></FONT></P>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P>Kaltura Capture is licensed for Penn State systems.</P></BLOCKQUOTE><STRONG>
<P><FONT size=3>About This Task</FONT></P></STRONG>
<BLOCKQUOTE>This task will install/upgrade: %NAME% %version% .<BR><BR>This task is applicable on: Windows systems</BLOCKQUOTE>
<P><FONT size=3><STRONG>Action Description</STRONG></FONT></P>
<UL><FONT size=2>
<LI><FONT size=2><STRONG>Action1: Install/upgrade.</STRONG></FONT></LI></UL>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P style="MARGIN-RIGHT: 0px" dir=ltr><FONT size=2>This action installs Kaltura Capture.</FONT></P></BLOCKQUOTE>
<UL dir=ltr>
<LI><FONT size=2><FONT size=2><STRONG>Action10: Make available in Self Service.</STRONG></FONT></FONT></LI></UL>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
<P><FONT size=2>This action performs the same action as Action1 with Self Service deployment options set.</FONT></P></BLOCKQUOTE></FONT>]]></string>
                <key>bes_category</key>
                <string>%OfferCategory%</string>
                <key>bes_relevance</key>
                <array>
                    <string>windows of operating system</string>
                    <string>x64 of operating system</string>
                    <string>not member of group 47448 /*CLM Division*/ of sites</string>
                    <string>not exists keys whose (value "DisplayName" of it as string starts with "Kaltura Capture" AND value "Publisher" of it as string contains "Kaltura" AND (value "DisplayVersion" of it as string as version) >= "4.1.6" as version) of keys "HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall" of native registry</string>
                </array>
                <key>bes_actions</key>
                <dict>
                    <key>1</key>
                    <dict>
                        <key>Description</key>
                        <array>
                            <string></string>
                            <string>Install/Upgrade</string>
                            <string>.</string>
                        </array>
                        <key>ActionName</key>
                        <string>DefaultAction</string>
                        <key>ActionNumber</key>
                        <string>Action1</string>
                        <key>ActionScript</key>
                        <string><![CDATA[
waithidden "{pathname of system folder & "\msiexec.exe"}" /i "{(pathname of client folder of current site) & "\__Download\%filename%"}" /qn /L*v "{(pathname of parent folder of client) & "\__BESData\__Global\Logs\Install_Kaltura_Capture" & "_" & ((year of it as string & month of it as two digits & day_of_month of it as two digits) of date (local time zone) of now & "-" & (two digit hour of it & two digit minute of it & two digit second of it) of time (local time zone) of now) & ".log"}" INSTALLDESKTOPSHORTCUT=0

//set SysMan tracking entry
regset64 "[HKEY_LOCAL_MACHINE\SOFTWARE\PSU\Sysman\Applications]" "{value of header "Subject" of active action}"="Install/Upgrade - {(month of it as two digits & "/" & day_of_month of it as two digits & "/" & year of it as string) of date (local time zone) of now}"]]></string>
                   </dict>
               </dict>
            </dict>
            <key>Processor</key>
            <string>AutoPkgBESEngine</string>
        </dict>
<!--        <dict>
            <key>Processor</key>
            <string>BESImporter</string>
            <key>Arguments</key>
            <dict>
                <key>bes_file</key>
                <string>%bes_file%</string>
                <key>bes_customsite</key>
                <string>SysManDev</string>
            </dict>
        </dict>-->
    </array>
</dict>
</plist>
