<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Microsoft Edge for the indicated platorm and branch</string>
		<key>Identifier</key>
		<string>com.github.iancohn.MicrosoftEdgeChromium</string>
		<key>Input</key>
		<dict>
			<key>PLATFORM</key>
			<string>Windows</string>
			<key>ARCHITECTURE</key>
			<string>x64</string>
			<key>PRODUCT</key>
			<string>Stable</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>com.github.iancohn.SharedProcessors/MicrosoftEdgeChromiumURLProvider</string>
				<key>Arguments</key>
				<dict>
					<key>PLATFORM</key>
					<string>%PLATFORM%</string>
					<key>ARCHITECTURE</key>
					<string>%ARCHITECTURE%</string>
					<key>PRODUCT</key>
					<string>%PRODUCT%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>filename</key>
					<string>%installer_version%.%installer_type%</string>
				</dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
