<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates .bes file for Microsoft Edge installer and uploads it to BigFix</string>
    <key>Identifier</key>
    <string>edu.psu.bigfix.msedge-win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Edge</string>
        <key>SHORTNAME</key>
        <string>Microsoft-Edge</string>
        <key>bes_icon</key>
        <string>http://bes.win.psu.edu:52311/ManualUploads/PSU/Icons/Microsoft-Edge.png</string>
        <key>OfferCategory</key>
        <string>Internet &amp; Web</string>
        <key>OfferDescriptionHTML</key>
        <string><![CDATA[<STRONG><FONT size=3>About Microsoft Edge</FONT></STRONG>
<BLOCKQUOTE><FONT size=3></FONT>&nbsp;</BLOCKQUOTE>
<P><FONT color=#0080ff size=3><STRONG>Licensing</STRONG></FONT></P>
<BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr><FONT size=3>
<P><FONT size=3>Microsoft Edge&nbsp;is freeware.</FONT></P></FONT></BLOCKQUOTE>]]></string>
        <key>bes_ssa</key>
        <string>True</string>
        <key>bes_ssaaction</key>
        <string>DefaultAction</string>
        <key>DESCRIPTION</key>
        <string><![CDATA[<DIV class=subsection>
          <P><FONT size=3><STRONG>About&nbsp;%NAME% </STRONG></FONT></P><FONT size=2>
          <BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
            <P>%OfferDescriptionHTML% </P>
          </BLOCKQUOTE>
          <STRONG><P><FONT size=3>About This Task</FONT></P></STRONG>
          <BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
            <P>This task will install/upgrade: %NAME%.<BR><BR></P>
            <P>This task is applicable on: Windows</P>
          </BLOCKQUOTE>
          <P><FONT size=3><STRONG>Action Description</STRONG></FONT></P>
          <UL><LI><FONT size=2><STRONG>Action1: Install/upgrade.</STRONG></FONT></LI></UL><BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
          <P><FONT size=2>This action installs the application  %NAME%.</FONT></P></BLOCKQUOTE></DIV>
          <UL><LI><FONT size=2><STRONG>Action10: Make available in Self Service.</STRONG></FONT></LI></UL><BLOCKQUOTE style="MARGIN-RIGHT: 0px" dir=ltr>
          <P><FONT size=2>This action performs the same action as Action1 with Self Service deployment options set.</FONT></P></BLOCKQUOTE></DIV>]]></string>
        <key>LICENSE</key>
        <string>%NAME% is freeware.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.iancohn.MicrosoftEdge</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>/Volumes/ManualUploads$/PSU-Windows/Microsoft/Edge/</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>EXENAME</key>
                <string>%SHORTNAME%-%version%.%installer_type%</string>
                <key>bes_overrideurl</key>
                <string>http://bes.win.psu.edu:52311/ManualUploads/PSU-Windows/Microsoft/Edge/%EXENAME%</string>
                <key>bes_filename</key>
                <string>%SHORTNAME%.msi</string>
                <!-- Enable to get prefetch from different file
                <key>bes_softwareinstaller</key>
                <string>%SHORTNAME%.exe</string>-->
                <key>bes_version</key>
                <string>%version%</string>
                <key>bes_title</key>
                <string>Install/Upgrade: %NAME% %version% - Windows</string>
                <key>bes_description</key>
                <string>%DESCRIPTION%</string>
                <key>bes_category</key>
                <string>%OfferCategory%</string>
                <key>bes_relevance</key>
                <array>
                    <string>windows of operating system</string>
                    <string>x64 of operating system</string>
                    <string>not member of group 47448 /*CLM Division*/ of sites</string>
                    <string>not exists key whose (value "DisplayName" of it as string contains "%NAME%" AND (it &gt;= "%version%" as version) of (value "DisplayVersion" of it as string as version)) of key "HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Uninstall" of registry</string>
                </array>
                <key>bes_actions</key>
                <dict>
                    <key>1</key>
                    <dict>
                        <key>Description</key>
                        <array>
                            <string></string>
                            <string>Install/Upgrade</string>
                            <string>.</string>
                        </array>
                        <key>ActionName</key>
                        <string>DefaultAction</string>
                        <key>ActionNumber</key>
                        <string>Action1</string>
                        <key>ActionScript</key>
                        <string>
//Run Installer
waithidden "{pathname of system folder &amp; "\msiexec.exe"}" /i "{pathname of file whose(name of it as lowercase ends with ".msi") of folder "__Download" of client folder of current site}" /qn /L*v "{(pathname of folder "__BESData\__Global\Logs" of parent folder of client) &amp; "\software_MSEdge.txt"}"

//set SysMan tracking info
regset64 "[HKEY_LOCAL_MACHINE\SOFTWARE\PSU\Sysman\Applications]" "{value of header "Subject" of active action}"="Install/Upgrade - {(month of it as two digits &amp; "/" &amp; day_of_month of it as two digits &amp; "/" &amp; year of it as string) of date (local time zone) of now}"</string>
                   </dict>
               </dict>
            </dict>
            <key>Processor</key>
            <string>AutoPkgBESEngine</string>
        </dict>
<!--        <dict>
            <key>Processor</key>
            <string>BESImporter</string>
            <key>Arguments</key>
            <dict>
                <key>bes_file</key>
                <string>%bes_file%</string>
                <key>bes_customsite</key>
                <string>SysManDev</string>
            </dict>
        </dict>-->
    </array>
</dict>
</plist>
