<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of HP Printer Essentials Software</string>
		<key>Identifier</key>
		<string>com.github.iancohn.download.HPPrinterEssentials</string>
		<key>Input</key>
		<dict/>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>com.github.iancohn.SharedProcessors/HPPrinterEssentialsURLProvider</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>filename</key>
					<string>hp-printer-essentials-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: HP Inc. (6HB5Y2QTA3)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>

			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
