<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of HP Printer Essentials Software</string>
		<key>Identifier</key>
		<string>com.github.iancohn.bigfix.HPPrinterEssentials</string>
		<key>Input</key>
		<dict/>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>ParentRecipe</key>
		<string>com.github.iancohn.download.HPPrinterEssentials</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/HPPrinterEssentials</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
<!--			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/HPPrinterDrivers</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileFinder</string>
				<key>Arguments</key>
				<dict>
						<key>pattern</key>
						<string>%RECIPE_CACHE_DIR%/HPPrinterEssentials/com.hp.print.ps.support.*.cpe.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%found_filename%/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/HPPrinterDrivers</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%found_filename%/Scripts</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/HPPrinterDrivers</string>
					<key></key>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%found_filename%/PackageInfo</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/HPPrinterDrivers</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgname</key>
					<string>HPPrinterDrivers-%version%</string>
					<key>pkg_request</key>
					<dict>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>id</key>
						<string>com.hp.printerdrivers</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications/Printers</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>-->
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
